mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/common/s6e2dhxj.h
/*******************************************************************************
* HWWDT_MODULE
*******************************************************************************/
typedef struct stc_hwwdt_wdg_ctl_field
{
        __IO  uint32_t  INTEN                    :1;
        __IO  uint32_t  RESEN                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hwwdt_wdg_ctl_field_t;

typedef struct stc_hwwdt_wdg_ris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hwwdt_wdg_ris_field_t;

/*******************************************************************************
* HYPERBUS_MODULE
*******************************************************************************/
typedef struct stc_hyperbus_csr_field
{
        __IO  uint32_t  RACT                     :1;
        __IO  uint32_t  RESERVED0                :7;
        __IO  uint32_t  RDECERR                  :1;
        __IO  uint32_t  RTRSERR                  :1;
        __IO  uint32_t  RRSTOERR                 :1;
        __IO  uint32_t  RDSSTALL                 :1;
        __IO  uint32_t  RESERVED1                :4;
        __IO  uint32_t  WACT                     :1;
        __IO  uint32_t  RESERVED2                :7;
        __IO  uint32_t  WDECERR                  :1;
        __IO  uint32_t  WTRSERR                  :1;
        __IO  uint32_t  WRSTOERR                 :1;
        __IO  uint32_t  RESERVED3                :5;
} stc_hyperbus_csr_field_t;

typedef struct stc_hyperbus_ien_field
{
        __IO  uint32_t  RPCINTE                  :1;
        __IO  uint32_t  RESERVED0                :30;
        __IO  uint32_t  INTP                     :1;
} stc_hyperbus_ien_field_t;

typedef struct stc_hyperbus_isr_field
{
        __IO  uint32_t  RPCINTS                  :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hyperbus_isr_field_t;

typedef struct stc_hyperbus_mbr0_field
{
    union {
        struct {
            __IO  uint32_t  MBR                  :32;
        };
        struct {
            __IO  uint32_t  MBR0                 :1;
            __IO  uint32_t  MBR1                 :1;
            __IO  uint32_t  MBR2                 :1;
            __IO  uint32_t  MBR3                 :1;
            __IO  uint32_t  MBR4                 :1;
            __IO  uint32_t  MBR5                 :1;
            __IO  uint32_t  MBR6                 :1;
            __IO  uint32_t  MBR7                 :1;
            __IO  uint32_t  MBR8                 :1;
            __IO  uint32_t  MBR9                 :1;
            __IO  uint32_t  MBR10                :1;
            __IO  uint32_t  MBR11                :1;
            __IO  uint32_t  MBR12                :1;
            __IO  uint32_t  MBR13                :1;
            __IO  uint32_t  MBR14                :1;
            __IO  uint32_t  MBR15                :1;
            __IO  uint32_t  MBR16                :1;
            __IO  uint32_t  MBR17                :1;
            __IO  uint32_t  MBR18                :1;
            __IO  uint32_t  MBR19                :1;
            __IO  uint32_t  MBR20                :1;
            __IO  uint32_t  MBR21                :1;
            __IO  uint32_t  MBR22                :1;
            __IO  uint32_t  MBR23                :1;
            __IO  uint32_t  MBR24                :1;
            __IO  uint32_t  MBR25                :1;
            __IO  uint32_t  MBR26                :1;
            __IO  uint32_t  MBR27                :1;
            __IO  uint32_t  MBR28                :1;
            __IO  uint32_t  MBR29                :1;
            __IO  uint32_t  MBR30                :1;
            __IO  uint32_t  MBR31                :1;
        };
    };
} stc_hyperbus_mbr0_field_t;

typedef struct stc_hyperbus_mbr1_field
{
    union {
        struct {
            __IO  uint32_t  MBR                  :32;
        };
        struct {
            __IO  uint32_t  MBR0                 :1;
            __IO  uint32_t  MBR1                 :1;
            __IO  uint32_t  MBR2                 :1;
            __IO  uint32_t  MBR3                 :1;
            __IO  uint32_t  MBR4                 :1;
            __IO  uint32_t  MBR5                 :1;
            __IO  uint32_t  MBR6                 :1;
            __IO  uint32_t  MBR7                 :1;
            __IO  uint32_t  MBR8                 :1;
            __IO  uint32_t  MBR9                 :1;
            __IO  uint32_t  MBR10                :1;
            __IO  uint32_t  MBR11                :1;
            __IO  uint32_t  MBR12                :1;
            __IO  uint32_t  MBR13                :1;
            __IO  uint32_t  MBR14                :1;
            __IO  uint32_t  MBR15                :1;
            __IO  uint32_t  MBR16                :1;
            __IO  uint32_t  MBR17                :1;
            __IO  uint32_t  MBR18                :1;
            __IO  uint32_t  MBR19                :1;
            __IO  uint32_t  MBR20                :1;
            __IO  uint32_t  MBR21                :1;
            __IO  uint32_t  MBR22                :1;
            __IO  uint32_t  MBR23                :1;
            __IO  uint32_t  MBR24                :1;
            __IO  uint32_t  MBR25                :1;
            __IO  uint32_t  MBR26                :1;
            __IO  uint32_t  MBR27                :1;
            __IO  uint32_t  MBR28                :1;
            __IO  uint32_t  MBR29                :1;
            __IO  uint32_t  MBR30                :1;
            __IO  uint32_t  MBR31                :1;
        };
    };
} stc_hyperbus_mbr1_field_t;

typedef struct stc_hyperbus_mcr0_field
{
    union {
        struct {
            __IO  uint32_t  WRAPSIZE             :2;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  DEVTYPE              :1;
            __IO  uint32_t  CRT                  :1;
            __IO  uint32_t  RESERVED1            :10;
            __IO  uint32_t  ACS                  :1;
            __IO  uint32_t  CRMO                 :1;
            __IO  uint32_t  RESERVED2            :14;
        };
        struct {
            __IO  uint32_t  WRAPSIZE0            :1;
            __IO  uint32_t  WRAPSIZE1            :1;
            __IO  uint32_t  RESERVED3            :30;
        };
    };
} stc_hyperbus_mcr0_field_t;

typedef struct stc_hyperbus_mcr1_field
{
    union {
        struct {
            __IO  uint32_t  WRAPSIZE             :2;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  DEVTYPE              :1;
            __IO  uint32_t  CRT                  :1;
            __IO  uint32_t  RESERVED1            :10;
            __IO  uint32_t  ACS                  :1;
            __IO  uint32_t  CRMO                 :1;
            __IO  uint32_t  RESERVED2            :14;
        };
        struct {
            __IO  uint32_t  WRAPSIZE0            :1;
            __IO  uint32_t  WRAPSIZE1            :1;
            __IO  uint32_t  RESERVED3            :30;
        };
    };
} stc_hyperbus_mcr1_field_t;

typedef struct stc_hyperbus_mtr0_field
{
    union {
        struct {
            __IO  uint32_t  LTCY                 :4;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  WCSH                 :4;
            __IO  uint32_t  RCSH                 :4;
            __IO  uint32_t  WCSS                 :4;
            __IO  uint32_t  RCSS                 :4;
            __IO  uint32_t  WCSHI                :4;
            __IO  uint32_t  RCSHI                :4;
        };
        struct {
            __IO  uint32_t  LTCY0                :1;
            __IO  uint32_t  LTCY1                :1;
            __IO  uint32_t  LTCY2                :1;
            __IO  uint32_t  LTCY3                :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  WCSH0                :1;
            __IO  uint32_t  WCSH1                :1;
            __IO  uint32_t  WCSH2                :1;
            __IO  uint32_t  WCSH3                :1;
            __IO  uint32_t  RCSH0                :1;
            __IO  uint32_t  RCSH1                :1;
            __IO  uint32_t  RCSH2                :1;
            __IO  uint32_t  RCSH3                :1;
            __IO  uint32_t  WCSS0                :1;
            __IO  uint32_t  WCSS1                :1;
            __IO  uint32_t  WCSS2                :1;
            __IO  uint32_t  WCSS3                :1;
            __IO  uint32_t  RCSS0                :1;
            __IO  uint32_t  RCSS1                :1;
            __IO  uint32_t  RCSS2                :1;
            __IO  uint32_t  RCSS3                :1;
            __IO  uint32_t  WCSHI0               :1;
            __IO  uint32_t  WCSHI1               :1;
            __IO  uint32_t  WCSHI2               :1;
            __IO  uint32_t  WCSHI3               :1;
            __IO  uint32_t  RCSHI0               :1;
            __IO  uint32_t  RCSHI1               :1;
            __IO  uint32_t  RCSHI2               :1;
            __IO  uint32_t  RCSHI3               :1;
        };
    };
} stc_hyperbus_mtr0_field_t;

typedef struct stc_hyperbus_mtr1_field
{
    union {
        struct {
            __IO  uint32_t  LTCY                 :4;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  WCSH                 :4;
            __IO  uint32_t  RCSH                 :4;
            __IO  uint32_t  WCSS                 :4;
            __IO  uint32_t  RCSS                 :4;
            __IO  uint32_t  WCSHI                :4;
            __IO  uint32_t  RCSHI                :4;
        };
        struct {
            __IO  uint32_t  LTCY0                :1;
            __IO  uint32_t  LTCY1                :1;
            __IO  uint32_t  LTCY2                :1;
            __IO  uint32_t  LTCY3                :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  WCSH0                :1;
            __IO  uint32_t  WCSH1                :1;
            __IO  uint32_t  WCSH2                :1;
            __IO  uint32_t  WCSH3                :1;
            __IO  uint32_t  RCSH0                :1;
            __IO  uint32_t  RCSH1                :1;
            __IO  uint32_t  RCSH2                :1;
            __IO  uint32_t  RCSH3                :1;
            __IO  uint32_t  WCSS0                :1;
            __IO  uint32_t  WCSS1                :1;
            __IO  uint32_t  WCSS2                :1;
            __IO  uint32_t  WCSS3                :1;
            __IO  uint32_t  RCSS0                :1;
            __IO  uint32_t  RCSS1                :1;
            __IO  uint32_t  RCSS2                :1;
            __IO  uint32_t  RCSS3                :1;
            __IO  uint32_t  WCSHI0               :1;
            __IO  uint32_t  WCSHI1               :1;
            __IO  uint32_t  WCSHI2               :1;
            __IO  uint32_t  WCSHI3               :1;
            __IO  uint32_t  RCSHI0               :1;
            __IO  uint32_t  RCSHI1               :1;
            __IO  uint32_t  RCSHI2               :1;
            __IO  uint32_t  RCSHI3               :1;
        };
    };
} stc_hyperbus_mtr1_field_t;

typedef struct stc_hyperbus_gpor_field
{
        __IO  uint32_t  GPO0                     :1;
        __IO  uint32_t  GPO1                     :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hyperbus_gpor_field_t;

