mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/common/s6e2dhxj.h
              __IO uint8_t TXEFCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFS;
        stc_canfd_txfs_field_t TXFS_f;
        struct {
          union {
            __IO uint16_t TXFSL;
            struct {
              __IO uint8_t TXFSLL;
              __IO uint8_t TXFSLH;
            };
          };
          union {
            __IO uint16_t TXFSH;
            struct {
              __IO uint8_t TXFSHL;
              __IO uint8_t TXFSHH;
            };
          };
        };
    };
    union {
        __IO uint32_t TXFA;
        stc_canfd_txfa_field_t TXFA_f;
        struct {
          union {
            __IO uint16_t TXFAL;
            struct {
              __IO uint8_t TXFALL;
              __IO uint8_t TXFALH;
            };
          };
          union {
            __IO uint16_t TXFAH;
            struct {
              __IO uint8_t TXFAHL;
              __IO uint8_t TXFAHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED6[260];
    union {
        __IO  uint8_t FDECR;
        stc_canfd_fdecr_field_t FDECR_f;
    };
    union {
        __IO  uint8_t FDESR;
        stc_canfd_fdesr_field_t FDESR_f;
    };
    union {
        __IO uint16_t FDSEAR;
        stc_canfd_fdsear_field_t FDSEAR_f;
        struct {
            __IO  uint8_t FDSEARL;
            __IO  uint8_t FDSEARH;
        };
    };
        __IO  uint8_t RESERVED7[1];
    union {
        __IO  uint8_t FDESCR;
        stc_canfd_fdescr_field_t FDESCR_f;
    };
    union {
        __IO uint16_t FDDEAR;
        stc_canfd_fddear_field_t FDDEAR_f;
        struct {
            __IO  uint8_t FDDEARL;
            __IO  uint8_t FDDEARH;
        };
    };
        __IO  uint8_t RESERVED8[8];
    union {
        __IO uint16_t TSCNTR;
        stc_canfd_tscntr_field_t TSCNTR_f;
        struct {
            __IO  uint8_t TSCNTRL;
            __IO  uint8_t TSCNTRH;
        };
    };
    union {
        __IO uint16_t TSMDR;
        stc_canfd_tsmdr_field_t TSMDR_f;
        struct {
            __IO  uint8_t TSMDRL;
            __IO  uint8_t TSMDRH;
        };
    };
    union {
        __IO uint32_t TSDIVR;
        stc_canfd_tsdivr_field_t TSDIVR_f;
        struct {
          union {
            __IO uint16_t TSDIVRL;
            struct {
              __IO uint8_t TSDIVRLL;
              __IO uint8_t TSDIVRLH;
            };
          };
          union {
            __IO uint16_t TSDIVRH;
            struct {
              __IO uint8_t TSDIVRHL;
              __IO uint8_t TSDIVRHH;
            };
          };
        };
    };
    union {
        __IO uint16_t TSCDTR;
        stc_canfd_tscdtr_field_t TSCDTR_f;
        struct {
            __IO  uint8_t TSCDTRL;
            __IO  uint8_t TSCDTRH;
        };
    };
    union {
        __IO uint16_t TSCPCLR;
        stc_canfd_tscpclr_field_t TSCPCLR_f;
        struct {
            __IO  uint8_t TSCPCLRL;
            __IO  uint8_t TSCPCLRH;
        };
    };
} FM_CANFD_TypeDef, FM4_CANFD_TypeDef;

/*******************************************************************************
* CANPRES_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t CANPRE;
        stc_canpres_canpre_field_t CANPRE_f;
    };
} FM_CANPRES_TypeDef, FM4_CANPRES_TypeDef;

/*******************************************************************************
* CLK_GATING_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t CKEN0;
        stc_clk_gating_cken0_field_t CKEN0_f;
        struct {
          union {
            __IO uint16_t CKEN0L;
            struct {
              __IO uint8_t CKEN0LL;
              __IO uint8_t CKEN0LH;
            };
          };
          union {
            __IO uint16_t CKEN0H;
            struct {
              __IO uint8_t CKEN0HL;
              __IO uint8_t CKEN0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t MRST0;
        stc_clk_gating_mrst0_field_t MRST0_f;
        struct {
          union {
            __IO uint16_t MRST0L;
            struct {
              __IO uint8_t MRST0LL;
              __IO uint8_t MRST0LH;
            };
          };
          union {
            __IO uint16_t MRST0H;
            struct {
              __IO uint8_t MRST0HL;
              __IO uint8_t MRST0HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[8];
    union {
        __IO uint32_t CKEN1;
        stc_clk_gating_cken1_field_t CKEN1_f;
        struct {
          union {
            __IO uint16_t CKEN1L;
            struct {
              __IO uint8_t CKEN1LL;
              __IO uint8_t CKEN1LH;
            };
          };
          union {
            __IO uint16_t CKEN1H;
            struct {
              __IO uint8_t CKEN1HL;
              __IO uint8_t CKEN1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t MRST1;
        stc_clk_gating_mrst1_field_t MRST1_f;
        struct {
          union {
            __IO uint16_t MRST1L;
            struct {
              __IO uint8_t MRST1LL;
              __IO uint8_t MRST1LH;
            };
          };
          union {
            __IO uint16_t MRST1H;
            struct {
              __IO uint8_t MRST1HL;
              __IO uint8_t MRST1HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[8];
    union {
        __IO uint32_t CKEN2;
        stc_clk_gating_cken2_field_t CKEN2_f;
        struct {
          union {
            __IO uint16_t CKEN2L;
            struct {
              __IO uint8_t CKEN2LL;
              __IO uint8_t CKEN2LH;
            };
          };
          union {
            __IO uint16_t CKEN2H;
            struct {
              __IO uint8_t CKEN2HL;
              __IO uint8_t CKEN2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t MRST2;
        stc_clk_gating_mrst2_field_t MRST2_f;
        struct {
          union {
            __IO uint16_t MRST2L;
            struct {
              __IO uint8_t MRST2LL;
              __IO uint8_t MRST2LH;
            };
          };
          union {
            __IO uint16_t MRST2H;
            struct {
              __IO uint8_t MRST2HL;
              __IO uint8_t MRST2HH;
            };
          };
        };
    };
} FM_CLK_GATING_TypeDef, FM4_CLK_GATING_TypeDef;

