mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/common/s6e2dhxj.h
#define bFM_BT7_PWM_STC_UDIR                      *((volatile  uint8_t *)(0x424A5A00UL))
#define bFM4_BT7_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424A5A00UL))
#define bFM_BT7_PWM_STC_DTIR                      *((volatile  uint8_t *)(0x424A5A04UL))
#define bFM4_BT7_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424A5A04UL))
#define bFM_BT7_PWM_STC_TGIR                      *((volatile  uint8_t *)(0x424A5A08UL))
#define bFM4_BT7_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424A5A08UL))
#define bFM_BT7_PWM_STC_UDIE                      *((volatile  uint8_t *)(0x424A5A10UL))
#define bFM4_BT7_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424A5A10UL))
#define bFM_BT7_PWM_STC_DTIE                      *((volatile  uint8_t *)(0x424A5A14UL))
#define bFM4_BT7_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424A5A14UL))
#define bFM_BT7_PWM_STC_TGIE                      *((volatile  uint8_t *)(0x424A5A18UL))
#define bFM4_BT7_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424A5A18UL))

#define bFM_BT7_PWM_TMCR_STRG                     *((volatile  uint8_t *)(0x424A5980UL))
#define bFM4_BT7_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424A5980UL))
#define bFM_BT7_PWM_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A5984UL))
#define bFM4_BT7_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A5984UL))
#define bFM_BT7_PWM_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A5988UL))
#define bFM4_BT7_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A5988UL))
#define bFM_BT7_PWM_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A598CUL))
#define bFM4_BT7_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A598CUL))
#define bFM_BT7_PWM_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A59A8UL))
#define bFM4_BT7_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A59A8UL))
#define bFM_BT7_PWM_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A59ACUL))
#define bFM4_BT7_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A59ACUL))

#define bFM_BT7_PWM_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A5A20UL))
#define bFM4_BT7_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A5A20UL))

#define bFM_BT7_RT_STC_UDIR                       *((volatile  uint8_t *)(0x424A5A00UL))
#define bFM4_BT7_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424A5A00UL))
#define bFM_BT7_RT_STC_TGIR                       *((volatile  uint8_t *)(0x424A5A08UL))
#define bFM4_BT7_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424A5A08UL))
#define bFM_BT7_RT_STC_UDIE                       *((volatile  uint8_t *)(0x424A5A10UL))
#define bFM4_BT7_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424A5A10UL))
#define bFM_BT7_RT_STC_TGIE                       *((volatile  uint8_t *)(0x424A5A18UL))
#define bFM4_BT7_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424A5A18UL))

#define bFM_BT7_RT_TMCR_STRG                      *((volatile  uint8_t *)(0x424A5980UL))
#define bFM4_BT7_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A5980UL))
#define bFM_BT7_RT_TMCR_CTEN                      *((volatile  uint8_t *)(0x424A5984UL))
#define bFM4_BT7_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A5984UL))
#define bFM_BT7_RT_TMCR_MDSE                      *((volatile  uint8_t *)(0x424A5988UL))
#define bFM4_BT7_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A5988UL))
#define bFM_BT7_RT_TMCR_OSEL                      *((volatile  uint8_t *)(0x424A598CUL))
#define bFM4_BT7_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A598CUL))
#define bFM_BT7_RT_TMCR_T32                       *((volatile  uint8_t *)(0x424A599CUL))
#define bFM4_BT7_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A599CUL))

#define bFM_BT7_RT_TMCR2_CKS3                     *((volatile  uint8_t *)(0x424A5A20UL))
#define bFM4_BT7_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A5A20UL))
#define bFM_BT7_RT_TMCR2_GATE                     *((volatile  uint8_t *)(0x424A5A3CUL))
#define bFM4_BT7_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A5A3CUL))


/*******************************************************************************
* BTIOSEL03 Registers BTIOSEL03
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* BTIOSEL47 Registers BTIOSEL47
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* CANFD Registers CANFD0
*   Bitband Section
*******************************************************************************/
#define bFM_CANFD0_CCCR_INIT                      *((volatile  uint8_t *)(0x42E00300UL))
#define bFM4_CANFD0_CCCR_INIT                     *((volatile  uint8_t *)(0x42E00300UL))
#define bFM_CANFD0_CCCR_CCE                       *((volatile  uint8_t *)(0x42E00304UL))
#define bFM4_CANFD0_CCCR_CCE                      *((volatile  uint8_t *)(0x42E00304UL))
#define bFM_CANFD0_CCCR_ASM                       *((volatile  uint8_t *)(0x42E00308UL))
#define bFM4_CANFD0_CCCR_ASM                      *((volatile  uint8_t *)(0x42E00308UL))
#define bFM_CANFD0_CCCR_CSA                       *((volatile  uint8_t *)(0x42E0030CUL))
#define bFM4_CANFD0_CCCR_CSA                      *((volatile  uint8_t *)(0x42E0030CUL))
#define bFM_CANFD0_CCCR_CSR                       *((volatile  uint8_t *)(0x42E00310UL))
#define bFM4_CANFD0_CCCR_CSR                      *((volatile  uint8_t *)(0x42E00310UL))
#define bFM_CANFD0_CCCR_MON                       *((volatile  uint8_t *)(0x42E00314UL))
#define bFM4_CANFD0_CCCR_MON                      *((volatile  uint8_t *)(0x42E00314UL))
#define bFM_CANFD0_CCCR_DAR                       *((volatile  uint8_t *)(0x42E00318UL))
#define bFM4_CANFD0_CCCR_DAR                      *((volatile  uint8_t *)(0x42E00318UL))
#define bFM_CANFD0_CCCR_TEST                      *((volatile  uint8_t *)(0x42E0031CUL))
#define bFM4_CANFD0_CCCR_TEST                     *((volatile  uint8_t *)(0x42E0031CUL))
#define bFM_CANFD0_CCCR_FDO                       *((volatile  uint8_t *)(0x42E00330UL))
#define bFM4_CANFD0_CCCR_FDO                      *((volatile  uint8_t *)(0x42E00330UL))
#define bFM_CANFD0_CCCR_FDBS                      *((volatile  uint8_t *)(0x42E00334UL))
#define bFM4_CANFD0_CCCR_FDBS                     *((volatile  uint8_t *)(0x42E00334UL))
#define bFM_CANFD0_CCCR_TXP                       *((volatile  uint8_t *)(0x42E00338UL))
#define bFM4_CANFD0_CCCR_TXP                      *((volatile  uint8_t *)(0x42E00338UL))

#define bFM_CANFD0_ECR_RP                         *((volatile  uint8_t *)(0x42E0083CUL))
#define bFM4_CANFD0_ECR_RP                        *((volatile  uint8_t *)(0x42E0083CUL))

#define bFM_CANFD0_FBTP_TDC                       *((volatile  uint8_t *)(0x42E001DCUL))
#define bFM4_CANFD0_FBTP_TDC                      *((volatile  uint8_t *)(0x42E001DCUL))

#define bFM_CANFD0_FDECR_SEIE                     *((volatile  uint8_t *)(0x42E04000UL))
#define bFM4_CANFD0_FDECR_SEIE                    *((volatile  uint8_t *)(0x42E04000UL))
#define bFM_CANFD0_FDECR_DEIE                     *((volatile  uint8_t *)(0x42E04004UL))
#define bFM4_CANFD0_FDECR_DEIE                    *((volatile  uint8_t *)(0x42E04004UL))
#define bFM_CANFD0_FDECR_CEREN                    *((volatile  uint8_t *)(0x42E04008UL))
#define bFM4_CANFD0_FDECR_CEREN                   *((volatile  uint8_t *)(0x42E04008UL))
#define bFM_CANFD0_FDECR_CEIV                     *((volatile  uint8_t *)(0x42E0400CUL))
#define bFM4_CANFD0_FDECR_CEIV                    *((volatile  uint8_t *)(0x42E0400CUL))

