mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dhxj/common/s6e2dhxj.h
#define bFM_EXTI_NMICL_NCL                        *((volatile  uint8_t *)(0x42600300UL))
#define bFM4_EXTI_NMICL_NCL                       *((volatile  uint8_t *)(0x42600300UL))

#define bFM_EXTI_NMIRR_NR                         *((volatile  uint8_t *)(0x42600280UL))
#define bFM4_EXTI_NMIRR_NR                        *((volatile  uint8_t *)(0x42600280UL))


/*******************************************************************************
* FLASH_IF Registers FLASH_IF
*   Bitband Section
*******************************************************************************/
#define bFM_FLASH_IF_FBFCR_BE                     *((volatile  uint8_t *)(0x42000280UL))
#define bFM4_FLASH_IF_FBFCR_BE                    *((volatile  uint8_t *)(0x42000280UL))
#define bFM_FLASH_IF_FBFCR_BS                     *((volatile  uint8_t *)(0x42000284UL))
#define bFM4_FLASH_IF_FBFCR_BS                    *((volatile  uint8_t *)(0x42000284UL))

#define bFM_FLASH_IF_FICLR_RDYIC                  *((volatile  uint8_t *)(0x42000500UL))
#define bFM4_FLASH_IF_FICLR_RDYIC                 *((volatile  uint8_t *)(0x42000500UL))
#define bFM_FLASH_IF_FICLR_HNGIC                  *((volatile  uint8_t *)(0x42000504UL))
#define bFM4_FLASH_IF_FICLR_HNGIC                 *((volatile  uint8_t *)(0x42000504UL))
#define bFM_FLASH_IF_FICLR_ERRIC                  *((volatile  uint8_t *)(0x42000508UL))
#define bFM4_FLASH_IF_FICLR_ERRIC                 *((volatile  uint8_t *)(0x42000508UL))

#define bFM_FLASH_IF_FICR_RDYIE                   *((volatile  uint8_t *)(0x42000400UL))
#define bFM4_FLASH_IF_FICR_RDYIE                  *((volatile  uint8_t *)(0x42000400UL))
#define bFM_FLASH_IF_FICR_HNGIE                   *((volatile  uint8_t *)(0x42000404UL))
#define bFM4_FLASH_IF_FICR_HNGIE                  *((volatile  uint8_t *)(0x42000404UL))
#define bFM_FLASH_IF_FICR_ERRIE                   *((volatile  uint8_t *)(0x42000408UL))
#define bFM4_FLASH_IF_FICR_ERRIE                  *((volatile  uint8_t *)(0x42000408UL))

#define bFM_FLASH_IF_FISR_RDYIF                   *((volatile  uint8_t *)(0x42000480UL))
#define bFM4_FLASH_IF_FISR_RDYIF                  *((volatile  uint8_t *)(0x42000480UL))
#define bFM_FLASH_IF_FISR_HNGIF                   *((volatile  uint8_t *)(0x42000484UL))
#define bFM4_FLASH_IF_FISR_HNGIF                  *((volatile  uint8_t *)(0x42000484UL))
#define bFM_FLASH_IF_FISR_ERRIF                   *((volatile  uint8_t *)(0x42000488UL))
#define bFM4_FLASH_IF_FISR_ERRIF                  *((volatile  uint8_t *)(0x42000488UL))

#define bFM_FLASH_IF_FSTR_RDY                     *((volatile  uint8_t *)(0x42000100UL))
#define bFM4_FLASH_IF_FSTR_RDY                    *((volatile  uint8_t *)(0x42000100UL))
#define bFM_FLASH_IF_FSTR_HNG                     *((volatile  uint8_t *)(0x42000104UL))
#define bFM4_FLASH_IF_FSTR_HNG                    *((volatile  uint8_t *)(0x42000104UL))
#define bFM_FLASH_IF_FSTR_ERR                     *((volatile  uint8_t *)(0x42000108UL))
#define bFM4_FLASH_IF_FSTR_ERR                    *((volatile  uint8_t *)(0x42000108UL))


/*******************************************************************************
* GDCPRE Registers GDCPRE
*   Bitband Section
*******************************************************************************/
#define bFM_GDCPRE_GCCR_GSSEN                     *((volatile  uint8_t *)(0x427A2000UL))
#define bFM4_GDCPRE_GCCR_GSSEN                    *((volatile  uint8_t *)(0x427A2000UL))

#define bFM_GDCPRE_GCSR_ACG                       *((volatile  uint8_t *)(0x427A2510UL))
#define bFM4_GDCPRE_GCSR_ACG                      *((volatile  uint8_t *)(0x427A2510UL))
#define bFM_GDCPRE_GCSR_PSEL                      *((volatile  uint8_t *)(0x427A2520UL))
#define bFM4_GDCPRE_GCSR_PSEL                     *((volatile  uint8_t *)(0x427A2520UL))
#define bFM_GDCPRE_GCSR_PCG                       *((volatile  uint8_t *)(0x427A2530UL))
#define bFM4_GDCPRE_GCSR_PCG                      *((volatile  uint8_t *)(0x427A2530UL))

#define bFM_GDCPRE_GMCR_TEN                       *((volatile  uint8_t *)(0x427A2600UL))
#define bFM4_GDCPRE_GMCR_TEN                      *((volatile  uint8_t *)(0x427A2600UL))

#define bFM_GDCPRE_GP_STR_GPRDY                   *((volatile  uint8_t *)(0x427A2280UL))
#define bFM4_GDCPRE_GP_STR_GPRDY                  *((volatile  uint8_t *)(0x427A2280UL))

#define bFM_GDCPRE_GPCR1_GPLLEN                   *((volatile  uint8_t *)(0x427A2080UL))
#define bFM4_GDCPRE_GPCR1_GPLLEN                  *((volatile  uint8_t *)(0x427A2080UL))
#define bFM_GDCPRE_GPCR1_GPINC                    *((volatile  uint8_t *)(0x427A2084UL))
#define bFM4_GDCPRE_GPCR1_GPINC                   *((volatile  uint8_t *)(0x427A2084UL))

#define bFM_GDCPRE_GPINT_CLR_GPCSC                *((volatile  uint8_t *)(0x427A2380UL))
#define bFM4_GDCPRE_GPINT_CLR_GPCSC               *((volatile  uint8_t *)(0x427A2380UL))

#define bFM_GDCPRE_GPINT_ENR_GPCSE                *((volatile  uint8_t *)(0x427A2300UL))
#define bFM4_GDCPRE_GPINT_ENR_GPCSE               *((volatile  uint8_t *)(0x427A2300UL))

#define bFM_GDCPRE_GPINT_STR_GPCSI                *((volatile  uint8_t *)(0x427A2400UL))
#define bFM4_GDCPRE_GPINT_STR_GPCSI               *((volatile  uint8_t *)(0x427A2400UL))

#define bFM_GDCPRE_GRCR_RSTEN                     *((volatile  uint8_t *)(0x427A2580UL))
#define bFM4_GDCPRE_GRCR_RSTEN                    *((volatile  uint8_t *)(0x427A2580UL))


/*******************************************************************************
* GDCSUB Registers GDCSUB
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* GPIO Registers GPIO
*   Bitband Section
*******************************************************************************/
#define bFM_GPIO_ADE_AN00                         *((volatile  uint8_t *)(0x42DEA000UL))
#define bFM4_GPIO_ADE_AN00                        *((volatile  uint8_t *)(0x42DEA000UL))
#define bFM_GPIO_ADE_AN01                         *((volatile  uint8_t *)(0x42DEA004UL))
#define bFM4_GPIO_ADE_AN01                        *((volatile  uint8_t *)(0x42DEA004UL))
#define bFM_GPIO_ADE_AN02                         *((volatile  uint8_t *)(0x42DEA008UL))
#define bFM4_GPIO_ADE_AN02                        *((volatile  uint8_t *)(0x42DEA008UL))
#define bFM_GPIO_ADE_AN03                         *((volatile  uint8_t *)(0x42DEA00CUL))
#define bFM4_GPIO_ADE_AN03                        *((volatile  uint8_t *)(0x42DEA00CUL))
#define bFM_GPIO_ADE_AN04                         *((volatile  uint8_t *)(0x42DEA010UL))
#define bFM4_GPIO_ADE_AN04                        *((volatile  uint8_t *)(0x42DEA010UL))
#define bFM_GPIO_ADE_AN05                         *((volatile  uint8_t *)(0x42DEA014UL))
#define bFM4_GPIO_ADE_AN05                        *((volatile  uint8_t *)(0x42DEA014UL))
#define bFM_GPIO_ADE_AN06                         *((volatile  uint8_t *)(0x42DEA018UL))
#define bFM4_GPIO_ADE_AN06                        *((volatile  uint8_t *)(0x42DEA018UL))
#define bFM_GPIO_ADE_AN07                         *((volatile  uint8_t *)(0x42DEA01CUL))
#define bFM4_GPIO_ADE_AN07                        *((volatile  uint8_t *)(0x42DEA01CUL))
#define bFM_GPIO_ADE_AN08                         *((volatile  uint8_t *)(0x42DEA020UL))
#define bFM4_GPIO_ADE_AN08                        *((volatile  uint8_t *)(0x42DEA020UL))
#define bFM_GPIO_ADE_AN09                         *((volatile  uint8_t *)(0x42DEA024UL))
#define bFM4_GPIO_ADE_AN09                        *((volatile  uint8_t *)(0x42DEA024UL))
#define bFM_GPIO_ADE_AN10                         *((volatile  uint8_t *)(0x42DEA028UL))
#define bFM4_GPIO_ADE_AN10                        *((volatile  uint8_t *)(0x42DEA028UL))
#define bFM_GPIO_ADE_AN11                         *((volatile  uint8_t *)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN11                        *((volatile  uint8_t *)(0x42DEA02CUL))
#define bFM_GPIO_ADE_AN12                         *((volatile  uint8_t *)(0x42DEA030UL))
#define bFM4_GPIO_ADE_AN12                        *((volatile  uint8_t *)(0x42DEA030UL))
#define bFM_GPIO_ADE_AN13                         *((volatile  uint8_t *)(0x42DEA034UL))
#define bFM4_GPIO_ADE_AN13                        *((volatile  uint8_t *)(0x42DEA034UL))
#define bFM_GPIO_ADE_AN14                         *((volatile  uint8_t *)(0x42DEA038UL))
#define bFM4_GPIO_ADE_AN14                        *((volatile  uint8_t *)(0x42DEA038UL))
#define bFM_GPIO_ADE_AN15                         *((volatile  uint8_t *)(0x42DEA03CUL))
#define bFM4_GPIO_ADE_AN15                        *((volatile  uint8_t *)(0x42DEA03CUL))
#define bFM_GPIO_ADE_AN16                         *((volatile  uint8_t *)(0x42DEA040UL))
#define bFM4_GPIO_ADE_AN16                        *((volatile  uint8_t *)(0x42DEA040UL))
#define bFM_GPIO_ADE_AN17                         *((volatile  uint8_t *)(0x42DEA044UL))
#define bFM4_GPIO_ADE_AN17                        *((volatile  uint8_t *)(0x42DEA044UL))
#define bFM_GPIO_ADE_AN18                         *((volatile  uint8_t *)(0x42DEA048UL))
#define bFM4_GPIO_ADE_AN18                        *((volatile  uint8_t *)(0x42DEA048UL))
#define bFM_GPIO_ADE_AN19                         *((volatile  uint8_t *)(0x42DEA04CUL))
#define bFM4_GPIO_ADE_AN19                        *((volatile  uint8_t *)(0x42DEA04CUL))
#define bFM_GPIO_ADE_AN20                         *((volatile  uint8_t *)(0x42DEA050UL))
#define bFM4_GPIO_ADE_AN20                        *((volatile  uint8_t *)(0x42DEA050UL))
#define bFM_GPIO_ADE_AN21                         *((volatile  uint8_t *)(0x42DEA054UL))
#define bFM4_GPIO_ADE_AN21                        *((volatile  uint8_t *)(0x42DEA054UL))
#define bFM_GPIO_ADE_AN22                         *((volatile  uint8_t *)(0x42DEA058UL))
#define bFM4_GPIO_ADE_AN22                        *((volatile  uint8_t *)(0x42DEA058UL))
#define bFM_GPIO_ADE_AN23                         *((volatile  uint8_t *)(0x42DEA05CUL))
#define bFM4_GPIO_ADE_AN23                        *((volatile  uint8_t *)(0x42DEA05CUL))

